# Merging DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
products = pd.read_csv('data/data/northwind-mongo-master/products.csv')

In [10]:
products.where(products['ProductName']=='Ravioli Angelo').dropna()

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
56,57.0,Ravioli Angelo,26.0,5.0,24 - 250 g pkgs.,19.5,36.0,0.0,20.0,0.0

In [11]:
categories = pd.read_csv('data/data/northwind-mongo-master/categories1.csv')

In [13]:
categories.loc[categories['CategoryID']==5]

   CategoryID    CategoryName Description
4           5  Grains/Cereals      Breads

In [14]:
suppliers = pd.read_csv('data/data/northwind-mongo-master/suppliers.csv')
suppliers.loc[suppliers['SupplierID']==26]

,SupplierID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
25,26,Pasta Buttini s.r.l.,Giovanni Giudici,Order Administrator,Via dei Gelsomini 153,Salerno,NaN,84100,Italy,(089) 6547665,(089) 6547667,NaN

# Concat DataFrames

In [15]:
mrbean = pd.read_csv('data/data/mrbean_facebook_statuses_join.csv',usecols=['status_message_mrbean','status_type','num_likes'])
mrbean.head()

                               status_message_mrbean status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079
1                                                NaN       photo     114008
2                                                NaN       photo     218579
3  Mr Bean is ready to do some shopping but bewar...       video      20338
4                                                NaN       photo     215591

In [16]:
nasa = pd.read_csv('data/data/nasa_facebook_statuses_join.csv',usecols=['status_message_nasa','status_type','num_likes'])
nasa.head()

                                 status_message_nasa status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142
1  Pluto's largest moon, Charon, is home to an un...       photo      19074
2  Our Restore-L mission is an endeavor to launch...       photo       7551
3  A new dark vortex was discovered in the atmosp...       photo      24359
4                                                NaN       video       2731

In [23]:
fb = pd.concat(objs=[mrbean,nasa],sort=True)

In [24]:
fb.head()

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video
1,114008,NaN,NaN,photo
2,218579,NaN,NaN,photo
3,20338,Mr Bean is ready to do some shopping but bewar...,NaN,video
4,215591,NaN,NaN,photo

In [25]:
fb.tail()

,num_likes,status_message_mrbean,status_message_nasa,status_type
758,39355,NaN,You've never seen Pluto like this before! New ...,photo
759,11835,NaN,Our cooperative field study in East Asia advan...,photo
760,15567,NaN,"After spending a #YearInSpace, astronaut Scott...",photo
761,41584,NaN,"Gravitational waves, predicted by Einstein and...",photo
762,12793,NaN,Have you ever used a GPS to help you get somew...,photo

In [26]:
fb = pd.concat(objs=[mrbean,nasa],sort=True,ignore_index=True)
fb.head()

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video
1,114008,NaN,NaN,photo
2,218579,NaN,NaN,photo
3,20338,Mr Bean is ready to do some shopping but bewar...,NaN,video
4,215591,NaN,NaN,photo

In [27]:
fb.loc[0]

num_likes                                                            16079
status_message_mrbean    It's time for Mr Bean and Teddy to get ready f...
status_message_nasa                                                    NaN
status_type                                                          video
Name: 0, dtype: object

In [31]:
mrbean.rename({'status_message_mrbean':'status_message'},axis=1,inplace=True)
nasa.rename({'status_message_nasa':'status_message'},axis=1,inplace=True)

In [32]:
fb = pd.concat(objs=[mrbean,nasa],sort=True,ignore_index=True)

In [33]:
fb.head()

   num_likes                                     status_message status_type
0      16079  It's time for Mr Bean and Teddy to get ready f...       video
1     114008                                                NaN       photo
2     218579                                                NaN       photo
3      20338  Mr Bean is ready to do some shopping but bewar...       video
4     215591                                                NaN       photo

# Join method

In [34]:
customer_names = pd.read_csv('data/data/northwind-mongo-master/customers.csv',usecols=['CustomerID','CompanyName'])
customer_cities = pd.read_csv('data/data/northwind-mongo-master/customers.csv',usecols=['CustomerID','City','Country'])

In [35]:
len(customer_cities)

91

In [36]:
len(customer_names)

91

In [37]:
customer_cities.set_index('CustomerID',inplace=True)

In [38]:
customer_names.set_index('CustomerID',inplace=True)

In [39]:
customer_names.join(customer_cities).head()

                                   CompanyName          City  Country
CustomerID
ALFKI                      Alfreds Futterkiste        Berlin  Germany
ANATR       Ana Trujillo Emparedados y helados  M?©xico D.F.   Mexico
ANTON                 Antonio Moreno Taquer?­a  M?©xico D.F.   Mexico
AROUT                          Around the Horn        London       UK
BERGS                      Berglunds snabbk?¶p        Lule??   Sweden

In [46]:
customer_city_names = customer_names.join(customer_cities,on='CustomerID')

In [47]:
customer_city_names.head()

                                   CompanyName          City  Country
CustomerID
ALFKI                      Alfreds Futterkiste        Berlin  Germany
ANATR       Ana Trujillo Emparedados y helados  M?©xico D.F.   Mexico
ANTON                 Antonio Moreno Taquer?­a  M?©xico D.F.   Mexico
AROUT                          Around the Horn        London       UK
BERGS                      Berglunds snabbk?¶p        Lule??   Sweden

In [48]:
len(customer_city_names)

91

# Merge method

In [3]:
f_2015 = pd.read_csv('data/data/Fortune_500_2015.csv',usecols=['rank','company'])
f_2016 = pd.read_csv('data/data/Fortune_500_2016.csv',usecols=['rank','company'])

In [8]:
companies_2015_2016 = f_2015.merge(f_2016,how='inner',on='company',suffixes=['_2015','_2016'])
companies_2015_2016.head()

   rank_2015             company  rank_2016
0          1             Walmart          1
1          2         Exxon Mobil          2
2          3             Chevron         14
3          4  Berkshire Hathaway          4
4          5               Apple          3

In [10]:
companies_2015_2016[companies_2015_2016['company']=='Microsoft']

    rank_2015    company  rank_2016
30         31  Microsoft       25.0

In [11]:
companies_2015_2016 = f_2015.merge(f_2016,how='outer',on='company',suffixes=['_2015','_2016'], indicator=True)
companies_2015_2016.head()

   rank_2015                 company  rank_2016      _merge
0       98.0                      3M       93.0        both
1      444.0  A-Mark Precious Metals      426.0        both
2        NaN          ABM Industries      485.0  right_only
3      251.0                     ADP      248.0        both
4      343.0                   AECOM      156.0        both

In [13]:
only_2015 = companies_2015_2016[companies_2015_2016['_merge']=='left_only']
only_2015.head()

    rank_2015                 company  rank_2016     _merge
7       465.0           AGL Resources        NaN  left_only
10      492.0             ARRIS Group        NaN  left_only
15      473.0  Advanced Micro Devices        NaN  left_only
18      389.0    Agilent Technologies        NaN  left_only
22      125.0                   Alcoa        NaN  left_only

In [14]:
only_2016 = companies_2015_2016[companies_2015_2016['_merge']=='right_only']
only_2016.head()

    rank_2015              company  rank_2016      _merge
2         NaN       ABM Industries      485.0  right_only
20        NaN               Airgas      484.0  right_only
49        NaN              Arconic      126.0  right_only
51        NaN  Arthur J. Gallagher      471.0  right_only
69        NaN              Baxalta      420.0  right_only

In [15]:
suppliers = pd.read_csv('data/data/northwind-mongo-master/suppliers_del_1.csv',usecols=['SupplierID','CompanyName','City'])

In [16]:
products = pd.read_csv('data/data/northwind-mongo-master/products_del_1.csv',usecols=['ProductID','ProductName','SupplierID'])

In [17]:
prod_and_sup = pd.merge(left=products, right=suppliers,how='inner',on='SupplierID')

In [18]:
len(prod_and_sup)

70

In [19]:
len(suppliers)

27

In [20]:
len(products)

75

In [23]:
prod_and_sup_outer = pd.merge(left=products, right=suppliers, how='outer', on='SupplierID', indicator=True)
left_check = prod_and_sup_outer['_merge']=='left_only'
prod_and_sup_outer[left_check]

    ProductID          ProductName  SupplierID CompanyName City     _merge
27       22.0  Gustaf's Knäckebröd           9         NaN  NaN  left_only
28       23.0             Tunnbröd           9         NaN  NaN  left_only
48       36.0          Inlagd Sill          17         NaN  NaN  left_only
49       37.0           Gravad lax          17         NaN  NaN  left_only
50       73.0           Röd Kaviar          17         NaN  NaN  left_only

In [22]:
right_check = prod_and_sup_outer['_merge']=='right_only'
prod_and_sup_outer[right_check].head()

,ProductID,ProductName,SupplierID,CompanyName,City,_merge
72,NaN,NaN,27,Escargots Nouveaux,Montceau,right_only

In [26]:
suppliers = pd.read_csv('data/data/northwind-mongo-master/suppliers.csv',usecols=['SupplierID','CompanyName','City'])

In [27]:
products = pd.read_csv('data/data/northwind-mongo-master/products_del_2.csv',usecols=['ProductID','ProductName','SupplierID'])

In [28]:
sup_prod = pd.merge(left=products, right=suppliers, how='inner', on='SupplierID',indicator=True)

In [31]:
len(suppliers)

29

In [33]:
len(products)

68

In [34]:
len(sup_prod)

68

In [35]:
sup_prod_left = suppliers.merge(products, how='left', on='SupplierID',indicator=True)

In [36]:
len(sup_prod_left)

70

In [37]:
sup_prod_left[sup_prod_left['_merge']=='left_only']

,SupplierID,CompanyName,City,ProductID,ProductName,_merge
2,2,New Orleans Cajun Delights,New Orleans,NaN,NaN,left_only
67,27,Escargots Nouveaux,Montceau,NaN,NaN,left_only

# merge options

In [38]:
suppliers = pd.read_csv('data/data/northwind-mongo-master/suppliers.csv',usecols=['SupplierID','CompanyName','City'])

In [39]:
products = pd.read_csv('data/data/northwind-mongo-master/products.csv',usecols=['ProductID','ProductName','SupplierID'])

In [40]:
suppliers.merge(products,how='inner',on='SupplierID').head()

,SupplierID,CompanyName,City,ProductID,ProductName
0,1,Exotic Liquids,London,1,Chai
1,1,Exotic Liquids,London,2,Chang
2,1,Exotic Liquids,London,3,Aniseed Syrup
3,2,New Orleans Cajun Delights,New Orleans,4,Chef Anton's Cajun Seasoning
4,2,New Orleans Cajun Delights,New Orleans,5,Chef Anton's Gumbo Mix

In [41]:
suppliers.set_index('SupplierID',inplace=True)

In [44]:
suppliers.merge(products,how='inner',left_index=True, right_on='SupplierID').head()

,CompanyName,City,ProductID,ProductName,SupplierID
0,Exotic Liquids,London,1,Chai,1
1,Exotic Liquids,London,2,Chang,1
2,Exotic Liquids,London,3,Aniseed Syrup,1
3,New Orleans Cajun Delights,New Orleans,4,Chef Anton's Cajun Seasoning,2
4,New Orleans Cajun Delights,New Orleans,5,Chef Anton's Gumbo Mix,2

In [45]:
products.set_index('ProductID',inplace=True)

In [49]:
suppliers.merge(products,how='inner',left_index=True, right_index=True).head()

,CompanyName,City,ProductName,SupplierID
1,Exotic Liquids,London,Chai,1
2,New Orleans Cajun Delights,New Orleans,Chang,1
3,Grandma Kelly's Homestead,Ann Arbor,Aniseed Syrup,1
4,Tokyo Traders,Tokyo,Chef Anton's Cajun Seasoning,2
5,Cooperativa de Quesos 'Las Cabras',Oviedo,Chef Anton's Gumbo Mix,2

In [50]:
suppliers.reset_index(inplace=True)

In [51]:
suppliers.merge(products,how='inner',left_on='SupplierID',right_index=True).head()

,SupplierID,SupplierID_x,CompanyName,City,ProductName,SupplierID_y
0,1,1,Exotic Liquids,London,Chai,1
1,2,2,New Orleans Cajun Delights,New Orleans,Chang,1
2,3,3,Grandma Kelly's Homestead,Ann Arbor,Aniseed Syrup,1
3,4,4,Tokyo Traders,Tokyo,Chef Anton's Cajun Seasoning,2
4,5,5,Cooperativa de Quesos 'Las Cabras',Oviedo,Chef Anton's Gumbo Mix,2

In [52]:
products.reset_index(inplace=True)

In [53]:
products.rename({'SupplierID':'supplier_id'},axis=1,inplace=True)

In [54]:
products.head()

   ProductID                   ProductName  supplier_id
0          1                          Chai            1
1          2                         Chang            1
2          3                 Aniseed Syrup            1
3          4  Chef Anton's Cajun Seasoning            2
4          5        Chef Anton's Gumbo Mix            2

In [55]:
suppliers.merge(products,how='inner',left_on='SupplierID',right_on='supplier_id').head()

,SupplierID,CompanyName,City,ProductID,ProductName,supplier_id
0,1,Exotic Liquids,London,1,Chai,1
1,1,Exotic Liquids,London,2,Chang,1
2,1,Exotic Liquids,London,3,Aniseed Syrup,1
3,2,New Orleans Cajun Delights,New Orleans,4,Chef Anton's Cajun Seasoning,2
4,2,New Orleans Cajun Delights,New Orleans,5,Chef Anton's Gumbo Mix,2